espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/bluetooth/inc/sl_btmesh_api.h
/* Command and Response IDs */
#define sl_btmesh_cmd_migration_migrate_keys_id                          0x01600028
#define sl_btmesh_cmd_migration_migrate_ddb_id                           0x02600028
#define sl_btmesh_rsp_migration_migrate_keys_id                          0x01600028
#define sl_btmesh_rsp_migration_migrate_ddb_id                           0x02600028

/***************************************************************************//**
 *
 * Ugrade keys from pre 3.2 release. Must be executed prior to to node or
 * Provisioner initialization.
 *
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_migration_migrate_keys();

/***************************************************************************//**
 *
 * Ugrade Device Database from pre 3.2 release. This command must be executed
 * prior to provisioner initialization. Command may not be issued twice.
 *
 *
 * @return SL_STATUS_OK if successful. Error code otherwise.
 *
 ******************************************************************************/
sl_status_t sl_btmesh_migration_migrate_ddb();

/** @} */ // end addtogroup sl_btmesh_migration


/***************************************************************************//**
 * @addtogroup sl_btmesh_common_types BTMESH Common Types
 * @{
 *  @brief BTMESH common types
 */

/**
 * @brief Data structure of BTMESH API messages
 */
PACKSTRUCT( struct sl_btmesh_msg {
  /** API protocol header consisting of event identifier and data length */
  uint32_t   header;

  /** Union of API event types */
  union {
    uint8_t handle;
    sl_btmesh_evt_node_initialized_t                             evt_node_initialized; /**< Data field for node initialized event*/
    sl_btmesh_evt_node_provisioned_t                             evt_node_provisioned; /**< Data field for node provisioned event*/
    sl_btmesh_evt_node_config_get_t                              evt_node_config_get; /**< Data field for node config_get event*/
    sl_btmesh_evt_node_config_set_t                              evt_node_config_set; /**< Data field for node config_set event*/
    sl_btmesh_evt_node_display_output_oob_t                      evt_node_display_output_oob; /**< Data field for node display_output_oob event*/
    sl_btmesh_evt_node_input_oob_request_t                       evt_node_input_oob_request; /**< Data field for node input_oob_request event*/
    sl_btmesh_evt_node_provisioning_started_t                    evt_node_provisioning_started; /**< Data field for node provisioning_started event*/
    sl_btmesh_evt_node_provisioning_failed_t                     evt_node_provisioning_failed; /**< Data field for node provisioning_failed event*/
    sl_btmesh_evt_node_key_added_t                               evt_node_key_added; /**< Data field for node key_added event*/
    sl_btmesh_evt_node_model_config_changed_t                    evt_node_model_config_changed; /**< Data field for node model_config_changed event*/
    sl_btmesh_evt_node_ivrecovery_needed_t                       evt_node_ivrecovery_needed; /**< Data field for node ivrecovery_needed event*/
    sl_btmesh_evt_node_changed_ivupdate_state_t                  evt_node_changed_ivupdate_state; /**< Data field for node changed_ivupdate_state event*/
    sl_btmesh_evt_node_key_removed_t                             evt_node_key_removed; /**< Data field for node key_removed event*/
    sl_btmesh_evt_node_key_updated_t                             evt_node_key_updated; /**< Data field for node key_updated event*/
    sl_btmesh_evt_node_heartbeat_t                               evt_node_heartbeat; /**< Data field for node heartbeat event*/
    sl_btmesh_evt_node_heartbeat_start_t                         evt_node_heartbeat_start; /**< Data field for node heartbeat_start event*/
    sl_btmesh_evt_node_heartbeat_stop_t                          evt_node_heartbeat_stop; /**< Data field for node heartbeat_stop event*/
    sl_btmesh_evt_node_beacon_received_t                         evt_node_beacon_received; /**< Data field for node beacon_received event*/
    sl_btmesh_evt_node_local_dcd_data_t                          evt_node_local_dcd_data; /**< Data field for node local_dcd_data event*/
    sl_btmesh_evt_node_local_dcd_data_end_t                      evt_node_local_dcd_data_end; /**< Data field for node local_dcd_data_end event*/
    sl_btmesh_evt_node_start_received_t                          evt_node_start_received; /**< Data field for node start_received event*/
    sl_btmesh_evt_prov_initialized_t                             evt_prov_initialized; /**< Data field for prov initialized event*/
    sl_btmesh_evt_prov_provisioning_suspended_t                  evt_prov_provisioning_suspended; /**< Data field for prov provisioning_suspended event*/
    sl_btmesh_evt_prov_capabilities_t                            evt_prov_capabilities; /**< Data field for prov capabilities event*/
    sl_btmesh_evt_prov_provisioning_failed_t                     evt_prov_provisioning_failed; /**< Data field for prov provisioning_failed event*/
    sl_btmesh_evt_prov_device_provisioned_t                      evt_prov_device_provisioned; /**< Data field for prov device_provisioned event*/
    sl_btmesh_evt_prov_unprov_beacon_t                           evt_prov_unprov_beacon; /**< Data field for prov unprov_beacon event*/
    sl_btmesh_evt_prov_oob_pkey_request_t                        evt_prov_oob_pkey_request; /**< Data field for prov oob_pkey_request event*/
    sl_btmesh_evt_prov_oob_auth_request_t                        evt_prov_oob_auth_request; /**< Data field for prov oob_auth_request event*/
    sl_btmesh_evt_prov_oob_display_input_t                       evt_prov_oob_display_input; /**< Data field for prov oob_display_input event*/
    sl_btmesh_evt_prov_ddb_list_t                                evt_prov_ddb_list; /**< Data field for prov ddb_list event*/
    sl_btmesh_evt_prov_uri_t                                     evt_prov_uri; /**< Data field for prov uri event*/
    sl_btmesh_evt_prov_key_refresh_phase_update_t                evt_prov_key_refresh_phase_update; /**< Data field for prov key_refresh_phase_update event*/
    sl_btmesh_evt_prov_key_refresh_node_update_t                 evt_prov_key_refresh_node_update; /**< Data field for prov key_refresh_node_update event*/
    sl_btmesh_evt_prov_key_refresh_complete_t                    evt_prov_key_refresh_complete; /**< Data field for prov key_refresh_complete event*/
    sl_btmesh_evt_prov_add_ddb_entry_complete_t                  evt_prov_add_ddb_entry_complete; /**< Data field for prov add_ddb_entry_complete event*/
    sl_btmesh_evt_prov_delete_ddb_entry_complete_t               evt_prov_delete_ddb_entry_complete; /**< Data field for prov delete_ddb_entry_complete event*/
    sl_btmesh_evt_prov_initialization_failed_t                   evt_prov_initialization_failed; /**< Data field for prov initialization_failed event*/
    sl_btmesh_evt_prov_start_sent_t                              evt_prov_start_sent; /**< Data field for prov start_sent event*/
    sl_btmesh_evt_proxy_connected_t                              evt_proxy_connected; /**< Data field for proxy connected event*/
    sl_btmesh_evt_proxy_disconnected_t                           evt_proxy_disconnected; /**< Data field for proxy disconnected event*/
    sl_btmesh_evt_proxy_filter_status_t                          evt_proxy_filter_status; /**< Data field for proxy filter_status event*/
    sl_btmesh_evt_vendor_model_receive_t                         evt_vendor_model_receive; /**< Data field for vendor_model receive event*/
    sl_btmesh_evt_vendor_model_send_complete_t                   evt_vendor_model_send_complete; /**< Data field for vendor_model send_complete event*/
    sl_btmesh_evt_health_client_server_status_t                  evt_health_client_server_status; /**< Data field for health_client server_status event*/
    sl_btmesh_evt_health_client_server_status_period_t           evt_health_client_server_status_period; /**< Data field for health_client server_status_period event*/
    sl_btmesh_evt_health_client_server_status_attention_t        evt_health_client_server_status_attention; /**< Data field for health_client server_status_attention event*/
    sl_btmesh_evt_health_server_attention_t                      evt_health_server_attention; /**< Data field for health_server attention event*/
    sl_btmesh_evt_health_server_test_request_t                   evt_health_server_test_request; /**< Data field for health_server test_request event*/
    sl_btmesh_evt_generic_client_server_status_t                 evt_generic_client_server_status; /**< Data field for generic_client server_status event*/
    sl_btmesh_evt_generic_server_client_request_t                evt_generic_server_client_request; /**< Data field for generic_server client_request event*/
    sl_btmesh_evt_generic_server_state_changed_t                 evt_generic_server_state_changed; /**< Data field for generic_server state_changed event*/
    sl_btmesh_evt_generic_server_state_recall_t                  evt_generic_server_state_recall; /**< Data field for generic_server state_recall event*/
    sl_btmesh_evt_test_local_heartbeat_subscription_complete_t   evt_test_local_heartbeat_subscription_complete; /**< Data field for test local_heartbeat_subscription_complete event*/
    sl_btmesh_evt_test_replay_protection_list_entry_set_t        evt_test_replay_protection_list_entry_set; /**< Data field for test replay_protection_list_entry_set event*/
    sl_btmesh_evt_test_replay_protection_list_entry_cleared_t    evt_test_replay_protection_list_entry_cleared; /**< Data field for test replay_protection_list_entry_cleared event*/
    sl_btmesh_evt_test_replay_protection_list_saved_t            evt_test_replay_protection_list_saved; /**< Data field for test replay_protection_list_saved event*/
    sl_btmesh_evt_lpn_friendship_established_t                   evt_lpn_friendship_established; /**< Data field for lpn friendship_established event*/
    sl_btmesh_evt_lpn_friendship_failed_t                        evt_lpn_friendship_failed; /**< Data field for lpn friendship_failed event*/
    sl_btmesh_evt_lpn_friendship_terminated_t                    evt_lpn_friendship_terminated; /**< Data field for lpn friendship_terminated event*/
    sl_btmesh_evt_friend_friendship_established_t                evt_friend_friendship_established; /**< Data field for friend friendship_established event*/
    sl_btmesh_evt_friend_friendship_terminated_t                 evt_friend_friendship_terminated; /**< Data field for friend friendship_terminated event*/
    sl_btmesh_evt_config_client_request_modified_t               evt_config_client_request_modified; /**< Data field for config_client request_modified event*/
    sl_btmesh_evt_config_client_netkey_status_t                  evt_config_client_netkey_status; /**< Data field for config_client netkey_status event*/
    sl_btmesh_evt_config_client_netkey_list_t                    evt_config_client_netkey_list; /**< Data field for config_client netkey_list event*/
    sl_btmesh_evt_config_client_netkey_list_end_t                evt_config_client_netkey_list_end; /**< Data field for config_client netkey_list_end event*/
    sl_btmesh_evt_config_client_appkey_status_t                  evt_config_client_appkey_status; /**< Data field for config_client appkey_status event*/
    sl_btmesh_evt_config_client_appkey_list_t                    evt_config_client_appkey_list; /**< Data field for config_client appkey_list event*/
    sl_btmesh_evt_config_client_appkey_list_end_t                evt_config_client_appkey_list_end; /**< Data field for config_client appkey_list_end event*/
    sl_btmesh_evt_config_client_binding_status_t                 evt_config_client_binding_status; /**< Data field for config_client binding_status event*/
    sl_btmesh_evt_config_client_bindings_list_t                  evt_config_client_bindings_list; /**< Data field for config_client bindings_list event*/
    sl_btmesh_evt_config_client_bindings_list_end_t              evt_config_client_bindings_list_end; /**< Data field for config_client bindings_list_end event*/
    sl_btmesh_evt_config_client_model_pub_status_t               evt_config_client_model_pub_status; /**< Data field for config_client model_pub_status event*/
    sl_btmesh_evt_config_client_model_sub_status_t               evt_config_client_model_sub_status; /**< Data field for config_client model_sub_status event*/
    sl_btmesh_evt_config_client_subs_list_t                      evt_config_client_subs_list; /**< Data field for config_client subs_list event*/
    sl_btmesh_evt_config_client_subs_list_end_t                  evt_config_client_subs_list_end; /**< Data field for config_client subs_list_end event*/
    sl_btmesh_evt_config_client_heartbeat_pub_status_t           evt_config_client_heartbeat_pub_status; /**< Data field for config_client heartbeat_pub_status event*/
    sl_btmesh_evt_config_client_heartbeat_sub_status_t           evt_config_client_heartbeat_sub_status; /**< Data field for config_client heartbeat_sub_status event*/
    sl_btmesh_evt_config_client_beacon_status_t                  evt_config_client_beacon_status; /**< Data field for config_client beacon_status event*/
    sl_btmesh_evt_config_client_default_ttl_status_t             evt_config_client_default_ttl_status; /**< Data field for config_client default_ttl_status event*/
    sl_btmesh_evt_config_client_gatt_proxy_status_t              evt_config_client_gatt_proxy_status; /**< Data field for config_client gatt_proxy_status event*/
    sl_btmesh_evt_config_client_relay_status_t                   evt_config_client_relay_status; /**< Data field for config_client relay_status event*/
    sl_btmesh_evt_config_client_network_transmit_status_t        evt_config_client_network_transmit_status; /**< Data field for config_client network_transmit_status event*/
    sl_btmesh_evt_config_client_identity_status_t                evt_config_client_identity_status; /**< Data field for config_client identity_status event*/
    sl_btmesh_evt_config_client_friend_status_t                  evt_config_client_friend_status; /**< Data field for config_client friend_status event*/
    sl_btmesh_evt_config_client_key_refresh_phase_status_t       evt_config_client_key_refresh_phase_status; /**< Data field for config_client key_refresh_phase_status event*/
    sl_btmesh_evt_config_client_lpn_polltimeout_status_t         evt_config_client_lpn_polltimeout_status; /**< Data field for config_client lpn_polltimeout_status event*/
    sl_btmesh_evt_config_client_dcd_data_t                       evt_config_client_dcd_data; /**< Data field for config_client dcd_data event*/
    sl_btmesh_evt_config_client_dcd_data_end_t                   evt_config_client_dcd_data_end; /**< Data field for config_client dcd_data_end event*/
    sl_btmesh_evt_config_client_reset_status_t                   evt_config_client_reset_status; /**< Data field for config_client reset_status event*/
    sl_btmesh_evt_sensor_server_get_request_t                    evt_sensor_server_get_request; /**< Data field for sensor_server get_request event*/
    sl_btmesh_evt_sensor_server_get_column_request_t             evt_sensor_server_get_column_request; /**< Data field for sensor_server get_column_request event*/
    sl_btmesh_evt_sensor_server_get_series_request_t             evt_sensor_server_get_series_request; /**< Data field for sensor_server get_series_request event*/
    sl_btmesh_evt_sensor_server_publish_t                        evt_sensor_server_publish; /**< Data field for sensor_server publish event*/
    sl_btmesh_evt_sensor_setup_server_get_cadence_request_t      evt_sensor_setup_server_get_cadence_request; /**< Data field for sensor_setup_server get_cadence_request event*/
    sl_btmesh_evt_sensor_setup_server_set_cadence_request_t      evt_sensor_setup_server_set_cadence_request; /**< Data field for sensor_setup_server set_cadence_request event*/
    sl_btmesh_evt_sensor_setup_server_get_settings_request_t     evt_sensor_setup_server_get_settings_request; /**< Data field for sensor_setup_server get_settings_request event*/
    sl_btmesh_evt_sensor_setup_server_get_setting_request_t      evt_sensor_setup_server_get_setting_request; /**< Data field for sensor_setup_server get_setting_request event*/
    sl_btmesh_evt_sensor_setup_server_set_setting_request_t      evt_sensor_setup_server_set_setting_request; /**< Data field for sensor_setup_server set_setting_request event*/
    sl_btmesh_evt_sensor_setup_server_publish_t                  evt_sensor_setup_server_publish; /**< Data field for sensor_setup_server publish event*/
    sl_btmesh_evt_sensor_client_descriptor_status_t              evt_sensor_client_descriptor_status; /**< Data field for sensor_client descriptor_status event*/
    sl_btmesh_evt_sensor_client_cadence_status_t                 evt_sensor_client_cadence_status; /**< Data field for sensor_client cadence_status event*/
    sl_btmesh_evt_sensor_client_settings_status_t                evt_sensor_client_settings_status; /**< Data field for sensor_client settings_status event*/
    sl_btmesh_evt_sensor_client_setting_status_t                 evt_sensor_client_setting_status; /**< Data field for sensor_client setting_status event*/
    sl_btmesh_evt_sensor_client_status_t                         evt_sensor_client_status; /**< Data field for sensor_client status event*/
    sl_btmesh_evt_sensor_client_column_status_t                  evt_sensor_client_column_status; /**< Data field for sensor_client column_status event*/
    sl_btmesh_evt_sensor_client_series_status_t                  evt_sensor_client_series_status; /**< Data field for sensor_client series_status event*/
    sl_btmesh_evt_sensor_client_publish_t                        evt_sensor_client_publish; /**< Data field for sensor_client publish event*/
    sl_btmesh_evt_lc_client_mode_status_t                        evt_lc_client_mode_status; /**< Data field for lc_client mode_status event*/
    sl_btmesh_evt_lc_client_om_status_t                          evt_lc_client_om_status; /**< Data field for lc_client om_status event*/
    sl_btmesh_evt_lc_client_light_onoff_status_t                 evt_lc_client_light_onoff_status; /**< Data field for lc_client light_onoff_status event*/
    sl_btmesh_evt_lc_client_property_status_t                    evt_lc_client_property_status; /**< Data field for lc_client property_status event*/
    sl_btmesh_evt_lc_server_mode_updated_t                       evt_lc_server_mode_updated; /**< Data field for lc_server mode_updated event*/
    sl_btmesh_evt_lc_server_om_updated_t                         evt_lc_server_om_updated; /**< Data field for lc_server om_updated event*/
    sl_btmesh_evt_lc_server_light_onoff_updated_t                evt_lc_server_light_onoff_updated; /**< Data field for lc_server light_onoff_updated event*/
    sl_btmesh_evt_lc_server_occupancy_updated_t                  evt_lc_server_occupancy_updated; /**< Data field for lc_server occupancy_updated event*/
    sl_btmesh_evt_lc_server_ambient_lux_level_updated_t          evt_lc_server_ambient_lux_level_updated; /**< Data field for lc_server ambient_lux_level_updated event*/
    sl_btmesh_evt_lc_server_linear_output_updated_t              evt_lc_server_linear_output_updated; /**< Data field for lc_server linear_output_updated event*/
    sl_btmesh_evt_lc_server_state_updated_t                      evt_lc_server_state_updated; /**< Data field for lc_server state_updated event*/
    sl_btmesh_evt_lc_server_regulator_debug_info_t               evt_lc_server_regulator_debug_info; /**< Data field for lc_server regulator_debug_info event*/
    sl_btmesh_evt_lc_setup_server_set_property_t                 evt_lc_setup_server_set_property; /**< Data field for lc_setup_server set_property event*/
    sl_btmesh_evt_scene_client_status_t                          evt_scene_client_status; /**< Data field for scene_client status event*/
    sl_btmesh_evt_scene_client_register_status_t                 evt_scene_client_register_status; /**< Data field for scene_client register_status event*/
    sl_btmesh_evt_scene_server_get_t                             evt_scene_server_get; /**< Data field for scene_server get event*/
    sl_btmesh_evt_scene_server_register_get_t                    evt_scene_server_register_get; /**< Data field for scene_server register_get event*/
    sl_btmesh_evt_scene_server_recall_t                          evt_scene_server_recall; /**< Data field for scene_server recall event*/
    sl_btmesh_evt_scene_server_publish_t                         evt_scene_server_publish; /**< Data field for scene_server publish event*/
    sl_btmesh_evt_scene_server_compact_recall_t                  evt_scene_server_compact_recall; /**< Data field for scene_server compact_recall event*/
    sl_btmesh_evt_scene_setup_server_store_t                     evt_scene_setup_server_store; /**< Data field for scene_setup_server store event*/
    sl_btmesh_evt_scene_setup_server_delete_t                    evt_scene_setup_server_delete; /**< Data field for scene_setup_server delete event*/
    sl_btmesh_evt_scene_setup_server_publish_t                   evt_scene_setup_server_publish; /**< Data field for scene_setup_server publish event*/
    sl_btmesh_evt_scheduler_client_status_t                      evt_scheduler_client_status; /**< Data field for scheduler_client status event*/
    sl_btmesh_evt_scheduler_client_action_status_t               evt_scheduler_client_action_status; /**< Data field for scheduler_client action_status event*/
    sl_btmesh_evt_scheduler_server_action_changed_t              evt_scheduler_server_action_changed; /**< Data field for scheduler_server action_changed event*/
    sl_btmesh_evt_scheduler_server_scene_changed_t               evt_scheduler_server_scene_changed; /**< Data field for scheduler_server scene_changed event*/
    sl_btmesh_evt_scheduler_server_action_triggered_t            evt_scheduler_server_action_triggered; /**< Data field for scheduler_server action_triggered event*/
    sl_btmesh_evt_time_server_time_updated_t                     evt_time_server_time_updated; /**< Data field for time_server time_updated event*/
    sl_btmesh_evt_time_server_time_zone_offset_updated_t         evt_time_server_time_zone_offset_updated; /**< Data field for time_server time_zone_offset_updated event*/
    sl_btmesh_evt_time_server_tai_utc_delta_updated_t            evt_time_server_tai_utc_delta_updated; /**< Data field for time_server tai_utc_delta_updated event*/
    sl_btmesh_evt_time_server_time_role_updated_t                evt_time_server_time_role_updated; /**< Data field for time_server time_role_updated event*/
    sl_btmesh_evt_time_client_time_status_t                      evt_time_client_time_status; /**< Data field for time_client time_status event*/
    sl_btmesh_evt_time_client_time_zone_status_t                 evt_time_client_time_zone_status; /**< Data field for time_client time_zone_status event*/
    sl_btmesh_evt_time_client_tai_utc_delta_status_t             evt_time_client_tai_utc_delta_status; /**< Data field for time_client tai_utc_delta_status event*/
    sl_btmesh_evt_time_client_time_role_status_t                 evt_time_client_time_role_status; /**< Data field for time_client time_role_status event*/
    uint8_t payload[SL_BGAPI_MAX_PAYLOAD_SIZE];
  } data;
});

/**
 * @brief Type definition for the data structure of BTMESH API messages
 */
typedef struct sl_btmesh_msg sl_btmesh_msg_t;

/** @} */ // end addtogroup sl_btmesh_common_types
/******************************************************************************/

/***************************************************************************//**
 * @addtogroup sl_bt_utility_functions Utility Functions
 *  @brief Utility functions for applications on SoC
 *  @{
 */

/**
 * Get the next event that requires processing by user application. Application
 * is not blocked if no event is waiting.
 *
 * @param event the pointer for storing the new event
 * @return SL_STATUS_OK if a new event is returned, or SL_STATUS_NOT_FOUND if no
 *   event is waiting; other value indicates an error occurred
 */
sl_status_t sl_btmesh_pop_event(sl_btmesh_msg_t* event);

/**
 * Check whether events are in queue pending for processing.
 * Call @ref sl_btmesh_pop_event to process pending events.
 *
 * @return true if event is pending; false otherwise
 */
bool sl_btmesh_event_pending(void);

/**
 * Check whether events are in queue pending for processing and return the next
 * event length in bytes if events are pending.
 * Call @ref sl_btmesh_pop_event to process pending events.
 *
 * @return the next event length if event is pending; 0 otherwise
 */
uint32_t sl_btmesh_event_pending_len(void);


/** @} */ // end addtogroup sl_bt_utility_functions
/******************************************************************************/

#ifdef __cplusplus
}
#endif

#endif